[
  {
    "name": "IdeaPad Pro 5 | 16 inch 2K Laptop | AMD Ryzen 5 8645HS | 16GB RAM | 512GB SSD | NVIDIA GeForce RTX 3050 | Windows 11 Home | Arctic Grey",
    "description": "The IdeaPad Pro 5 offers high-end performance with an AMD Ryzen 5 processor and NVIDIA GeForce RTX 3050 graphics card. Equipped with 16GB of RAM and a 512GB SSD, this laptop provides fast speeds and ample storage. Whether you're gaming, editing, or multitasking, the 16-inch 2K display delivers stunning visuals. Its lightweight design and Arctic Grey color make it both portable and stylish. Additionally, it comes with Windows 11 Home, offering a modern user experience. With long battery life and high-resolution support, it's ideal for both work and entertainment needs.",
    "category": "652aebc2cde2a200b9a871af",
    "reviews": "652aebd7cde2a200b9a871b1",
    "brand": "652aebd7cde2a200b9a871b1",
    "price": 1299.99,
    "coupons": "652aeffbcde2a200b9a871b5",
    "currency": "USD"
  },
  {
    "name": "Galaxy Z Fold 4 | 256GB 5G Smartphone | 7.6 inch AMOLED | Snapdragon 8 Gen 2 | Triple Camera | Phantom Black | Foldable Display",
    "description": "The Galaxy Z Fold 4 is Samsung's cutting-edge foldable smartphone, featuring a large 7.6-inch AMOLED display that folds to fit in your pocket. Powered by the Snapdragon 8 Gen 2 processor, this phone offers blazing fast speeds for multitasking and gaming. With a triple camera setup, you can capture high-quality photos and videos in any setting. The 256GB internal storage provides plenty of space for apps, media, and files. Its sleek Phantom Black color and foldable design make it a statement piece. This device is also 5G enabled, allowing for the fastest mobile data speeds available today.",
    "category": "652aebc2cde2a200b9a871af",
    "brand": "652aebd7cde2a200b9a871b2",
    "price": 1799.99,
    "images": "https://example.com/image1.jpg",
    "coupons": "652aeffbcde2a200b9a871b6",
    "currency": "USD"
  },
  {
    "name": "Razer Blade 15 | 15.6 inch Gaming Laptop | Intel i7 13800H | 32GB RAM | 1TB SSD | NVIDIA RTX 4080 | Windows 11 Pro | Matte Black",
    "description": "The Razer Blade 15 is the ultimate gaming laptop for enthusiasts and professionals alike. Featuring an Intel i7 13800H processor and NVIDIA RTX 4080 graphics card, this machine delivers unbeatable performance for gaming, content creation, and more. With 32GB of RAM and a 1TB SSD, you'll experience lightning-fast load times and seamless multitasking. The 15.6-inch display provides crisp visuals, perfect for both gaming and media consumption. Its sleek matte black finish and customizable RGB lighting add a touch of flair to your setup. Whether you're on the go or at your desk, this laptop is built to impress.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b3",
    "price": 2999.99,
    "images": "https://example.com/image1.jpg",
    "coupons": "652aeffbcde2a200b9a871b7",
    "currency": "USD"
  },
  {
    "name": "Sony Alpha A7 IV | 33MP Full-Frame Mirrorless Camera | 4K Video Recording | 5-Axis Stabilization | Fast Autofocus | Black",
    "description": "The Sony Alpha A7 IV is a powerful full-frame mirrorless camera designed for both photography and videography professionals. Featuring a 33MP sensor, it captures stunning images with incredible detail and dynamic range. Its 5-axis image stabilization ensures that your shots remain sharp even in challenging conditions. The camera supports 4K video recording at 60fps, making it a great tool for content creators and filmmakers. With its fast autofocus and advanced subject tracking, you'll never miss a shot. Its lightweight and compact design make it perfect for travel, while its professional-grade features set it apart from the competition.",
    "category": "652aebd2cde2a200b9a871b0",
    "images": "https://example.com/image5.jpg",
    "brand": "652aebd7cde2a200b9a871b4",
    "price": 2499.99,
    "coupons": "652aeffbcde2a200b9a871b8",
    "currency": "USD"
  },
  {
    "name": "Apple MacBook Pro 14 | M2 Pro Chip | 14 inch Retina Display | 16GB RAM | 512GB SSD | Space Gray | Magic Keyboard",
    "description": "The Apple MacBook Pro 14 with the M2 Pro Chip is a powerhouse designed for professionals. The M2 Pro chip provides blazing-fast performance for video editing, coding, and multitasking. With 16GB of RAM and a 512GB SSD, you get plenty of speed and storage for all your applications. The 14-inch Retina display offers vibrant colors and high resolution, perfect for creative work. Its slim design and Space Gray finish make it portable and stylish, while the Magic Keyboard provides a comfortable typing experience. Whether you’re on the go or working from home, this MacBook Pro is built for productivity.",
    "category": "652aebd2cde2a200b9a871b0",
    "images": "https://example.com/image52.jpg",
    "brand": "652aebd7cde2a200b9a871b1",
    "price": 2199.99,
    "coupons": "652aeffbcde2a200b9a871b9",
    "currency": "USD"
  },
  {
    "name": "Bose QuietComfort 45 | Over-Ear Wireless Headphones | Noise Cancelling | Bluetooth 5.1 | Up to 24 Hours Battery | Black",
    "description": "The Bose QuietComfort 45 offers superior sound quality with its active noise-cancelling technology. Perfect for both music lovers and professionals on the go, these wireless headphones offer up to 24 hours of playtime on a single charge. Featuring Bluetooth 5.1 for a stable and quick connection, you can enjoy your music or calls without interruptions. The headphones are lightweight and comfortable, making them ideal for long listening sessions. With crystal-clear audio and deep bass, every song sounds better. Plus, its sleek black design pairs well with any outfit or style. A perfect companion for travel or everyday use.",
    "category": "652aebc2cde2a200b9a871af",
    "brand": "652aebd7cde2a200b9a871b3",
    "price": 329.99,
    "images": "https://example.com/image55.jpg",
    "coupons": "652aeffbcde2a200b9a871b6",
    "currency": "USD"
  },
  {
    "name": "Samsung Odyssey Neo G9 | 49 inch Curved Gaming Monitor | QLED | 240Hz Refresh Rate | 5120x1440 Resolution | Dual QHD | Quantum HDR2000 | White",
    "description": "The Samsung Odyssey Neo G9 is the ultimate gaming monitor with a massive 49-inch curved display that immerses you in every scene. Featuring QLED technology, this monitor delivers deep blacks, bright whites, and stunning colors. With a 5120x1440 Dual QHD resolution and a 240Hz refresh rate, you'll experience incredibly smooth and responsive gameplay. Quantum HDR2000 enhances the dynamic range, offering richer visuals. Whether you're playing competitive games or watching movies, this monitor is designed for the best performance. Its sleek white design and futuristic look make it a great addition to any gaming setup.",
    "category": "652aebc2cde2a200b9a871af",
    "brand": "652aebd7cde2a200b9a871b2",
    "images": "https://example.com/image9.jpg",
    "price": 2299.99,
    "coupons": "652aeffbcde2a200b9a871b5",
    "currency": "USD"
  },
  {
    "name": "Apple iPhone 14 Pro Max | 256GB | 6.7 inch Super Retina XDR Display | A16 Bionic Chip | Triple Camera System | Deep Purple",
    "description": "The iPhone 14 Pro Max redefines smartphone performance with its powerful A16 Bionic chip and advanced triple-camera system. The 6.7-inch Super Retina XDR display delivers vibrant colors and sharp details, making it perfect for both work and entertainment. With 256GB of internal storage, you'll have plenty of space for apps, media, and files. The triple camera system allows for professional-quality photography, including night mode and ProRAW support. Finished in Deep Purple, this phone combines power and elegance. Whether you're streaming videos or playing games, the iPhone 14 Pro Max offers an exceptional user experience.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b3",
    "price": 1199.99,
    "images": "https://example.com/image58.jpg",
    "coupons": "652aeffbcde2a200b9a871b9",
    "currency": "USD"
  },
  {
    "name": "Dell XPS 17 | 17 inch 4K UHD+ Touch Laptop | Intel i9 13900HK | 32GB RAM | 1TB SSD | NVIDIA RTX 4070 | Platinum Silver | Windows 11 Home",
    "description": "The Dell XPS 17 is a premium laptop designed for professionals who need power and performance. Featuring a 17-inch 4K UHD+ touch display, it provides crystal-clear visuals and a large workspace for multitasking. Powered by the Intel i9 13900HK processor and NVIDIA RTX 4070 graphics, this laptop handles demanding tasks such as video editing and 3D rendering with ease. The 32GB of RAM and 1TB SSD ensure fast and responsive performance. Its sleek platinum silver design and lightweight form make it portable without compromising on power. Perfect for creators, designers, and anyone who needs a top-tier machine.",
    "category": "652aebc2cde2a200b9a871af",
    "brand": "652aebd7cde2a200b9a871b2",
    "images": "https://example.com/image12.jpg",
    "price": 3499.99,
    "coupons": "652aeffbcde2a200b9a871b5",
    "currency": "USD"
  },
  {
    "name": "Fitbit Sense 2 | Advanced Health & Fitness Smartwatch | ECG, EDA, Heart Rate, Sleep Tracking | 6+ Day Battery | Lunar White/Soft Gold",
    "description": "The Fitbit Sense 2 is the most advanced health and fitness smartwatch from Fitbit, offering a wide array of features to help you stay on top of your wellness. With ECG, EDA, and heart rate monitoring, it provides insights into your heart health and stress levels. Sleep tracking helps you optimize your rest, while built-in GPS allows you to track outdoor activities accurately. The 6+ day battery life ensures you stay connected without needing frequent charges. Its sleek Lunar White/Soft Gold design makes it stylish for everyday wear, and it's compatible with both Android and iOS.",
    "category": "652aebd2cde2a200b9a871b0",
    "images": "https://example.com/image83.jpg",
    "brand": "652aebd7cde2a200b9a871b1",
    "price": 299.99,
    "coupons": "652aeffbcde2a200b9a871b8",
    "currency": "USD"
  },
  {
    "name": "Microsoft Surface Pro 9 | 13 inch 2-in-1 Tablet Laptop | Intel Evo i7 | 16GB RAM | 512GB SSD | Platinum | Windows 11 Pro",
    "description": "The Microsoft Surface Pro 9 is a versatile 2-in-1 device that combines the power of a laptop with the flexibility of a tablet. The 13-inch display with PixelSense technology offers stunning visuals, making it perfect for both creative work and productivity. Powered by an Intel Evo i7 processor, 16GB RAM, and a 512GB SSD, it delivers fast performance for all your tasks. The Platinum color adds a premium feel, and its lightweight design makes it easy to carry wherever you go. With Windows 11 Pro, you'll have the latest features and enhanced security for work and play.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b4",
    "images": "https://example.com/image16.jpg",
    "price": 1899.99,
    "coupons": "652aeffbcde2a200b9a871b9",
    "currency": "USD"
  },
  {
    "name": "Canon EOS R5 | 45MP Full-Frame Mirrorless Camera | 8K Video Recording | Dual Pixel CMOS AF II | In-Body Image Stabilization | Black",
    "description": "The Canon EOS R5 is a professional-grade mirrorless camera designed for photographers and videographers who demand the best. With a 45MP full-frame sensor, it delivers stunning image quality with exceptional detail and color accuracy. The camera supports 8K video recording, offering filmmakers the ability to capture incredibly high-resolution footage. Dual Pixel CMOS AF II provides fast and accurate autofocus, even in challenging lighting conditions. In-body image stabilization ensures steady shots, whether you're shooting handheld or on the move. Its rugged build and advanced features make it a top choice for professionals.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b3",
    "price": 3899.99,
    "images": "https://example.com/image22.jpg",
    "coupons": "652aeffbcde2a200b9a871b7",
    "currency": "USD"
  },
  {
    "name": "Sony PlayStation 5 | 825GB SSD Console | Ultra HD Blu-ray | Ray Tracing | 8K Output | 3D Audio Technology | DualSense Wireless Controller | White",
    "description": "The Sony PlayStation 5 delivers next-gen gaming experiences with breathtaking graphics and lightning-fast load times. With an 825GB SSD, you'll experience near-instantaneous load times, making your gaming sessions smoother. The PS5 supports 4K gaming at up to 120fps, with the potential for 8K output for future games. Ray tracing brings realistic lighting and shadows to your games, while 3D Audio technology enhances the immersive experience. The DualSense wireless controller provides haptic feedback and adaptive triggers for more interactive gameplay. Its sleek white design is a perfect fit for any modern living room.",
    "category": "652aebc2cde2a200b9a871af",
    "images": "https://example.com/image19.jpg",
    "brand": "652aebd7cde2a200b9a871b2",
    "price": 499.99,
    "coupons": "652aeffbcde2a200b9a871b5",
    "currency": "USD"
  },
  {
    "name": "Logitech MX Master 3S | Advanced Wireless Mouse | 4000 DPI Sensor | Ultra-fast Scrolling | Ergonomic Design | Bluetooth | Graphite",
    "description": "The Logitech MX Master 3S is the ultimate productivity mouse, designed for those who demand precision and comfort. With a 4000 DPI sensor, it works flawlessly on any surface, including glass. The ultra-fast scrolling feature allows you to fly through long documents and web pages in a snap. Its ergonomic design fits comfortably in your hand, reducing strain during long work sessions. The mouse connects via Bluetooth or the included USB receiver, providing a stable and reliable connection. Its sleek graphite finish makes it a stylish addition to any workspace, whether at home or the office.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b1",
    "price": 99.99,
    "coupons": "652aeffbcde2a200b9a871b8",
    "currency": "USD"
  },
  {
    "name": "HP Envy 34 All-in-One | 34 inch 5K Ultra-Wide Display | Intel i7 13700K | 16GB RAM | 1TB SSD | NVIDIA RTX 3070 | Windows 11 Home | Silver",
    "description": "The HP Envy 34 All-in-One is a powerful and stylish desktop computer that saves space while delivering top-tier performance. The 34-inch 5K ultra-wide display provides a massive workspace, perfect for multitasking and creative work. Powered by the Intel i7 13700K processor and NVIDIA RTX 3070 graphics card, this machine handles demanding applications with ease. With 16GB of RAM and a 1TB SSD, you get lightning-fast performance and ample storage. The sleek silver design complements any modern office or home setup, making it both functional and aesthetically pleasing. Ideal for professionals and creators alike.",
    "category": "652aebc2cde2a200b9a871af",
    "brand": "652aebd7cde2a200b9a871b2",
    "price": 2899.99,
    "coupons": "652aeffbcde2a200b9a871b5",
    "currency": "USD"
  },
  {
    "name": "Dyson V15 Detect | Cordless Vacuum Cleaner | Laser Slim Fluffy Cleaner Head | Up to 60 Minutes of Runtime | HEPA Filtration | Yellow",
    "description": "The Dyson V15 Detect is a cordless vacuum cleaner that offers powerful suction and advanced cleaning technology. Featuring a Laser Slim Fluffy cleaner head, it illuminates hidden dust and debris on hard floors. With up to 60 minutes of runtime, it’s perfect for cleaning large spaces without needing to recharge. The HEPA filtration system captures 99.97% of particles as small as 0.3 microns, ensuring cleaner air as you vacuum. Its lightweight and cordless design make it easy to maneuver, while the bright yellow finish adds a modern touch. Ideal for pet owners, allergy sufferers, and anyone who wants a spotless home.",
    "category": "652aebd2cde2a200b9a871b0",
    "brand": "652aebd7cde2a200b9a871b1",
    "price": 749.99,
    "coupons": "652aeffbcde2a200b9a871b9",
    "currency": "USD"
  }
]
